brew "git"                          # Up to date version of git over MacOS version
brew "zsh-autosuggestions"          # Auto suggestions for zsh
brew "zsh-syntax-highlighting"      # Syntax highlighting for zsh
brew "zsh-history-substring-search" # History search
brew "go"                           # Golang
brew "gh"                           # Github CLI
brew "nodenv"                       # Node package manager
brew "python"                       # Python for powerline

tap "homebrew/cask"
cask "rectangle"                # Window management app (like Spectacle)
cask "iterm2"                   # Terminal replacement
cask "visual-studio-code"       # VSCode editor
cask "sourcetree"               # Git GUI
cask "p4v"                      # P4Merge tool
cask "firefox"                  # Browser of choice
cask "1password"                # Password manager
cask "zoom"                     # Zoom video conferencing
cask "spotify"                  # Music
cask "twitch"                   # Twitch

tap "homebrew/cask-fonts"
cask "font-jetbrains-mono"      # Coding font
