brew "git"                          # Up to date version of git over MacOS version
brew "zsh-autosuggestions"          # Auto suggestions for zsh
brew "zsh-syntax-highlighting"      # Syntax highlighting for zsh
brew "zsh-history-substring-search" # History search
brew "gh"                           # Github CLI
brew "tfenv"                        # Terraform manager
brew "python"                       # Python for powerline
brew "gnupg"                        # GPG for Github verification
brew "pinentry-mac"                 # Allow GPG passphrase to be saved to keychain
brew "svn"                          # Required for font downloads
brew "graphviz"                     # Go pprof visualizations
brew "docker"                       # Docker for Mac
brew "asdf"                         # Managing binary versions 

tap "homebrew/cask"
cask "rectangle"                # Window management app (like Spectacle)
cask "warp"                     # Terminal replacement 
cask "visual-studio-code"       # VSCode editor
cask "sourcetree"               # Git GUI
cask "p4v"                      # P4Merge tool
cask "google-chrome"            # Browser of choice
cask "1password"                # Password manager
cask "zoom"                     # Zoom video conferencing
cask "spotify"                  # Music
cask "obsidian"                 # Note taking
cask "google-drive"             # Google Drive
cask "slack"                    # Slack

tap "homebrew/cask-fonts"
cask "font-jetbrains-mono"      # Coding font
cask "font-inconsolata"         # Monospace font
