brew "git"                          # Up to date version of git over MacOS version
brew "zsh-autosuggestions"          # Auto suggestions for zsh
brew "zsh-syntax-highlighting"      # Syntax highlighting for zsh
brew "zsh-history-substring-search" # History search
brew "go"                           # Golang
brew "gh"                           # Github CLI
brew "nodenv"                       # Node manager
brew "rbenv"                        # Ruby manager
brew "tfenv"                        # Terraform manager
brew "grep"                         # - Required for terraform
brew "pcre"                         # - Required for terraform
brew "yarn"                         # Yarn for rails projects
brew "python"                       # Python for powerline
brew "gnupg"                        # GPG for Github verification
brew "pinentry-mac"                 # Allow GPG passphrase to be saved to keychain
brew "svn"                          # Required for font downloads

tap "homebrew/cask"
cask "rectangle"                # Window management app (like Spectacle)
cask "iterm2"                   # Terminal replacement
cask "visual-studio-code"       # VSCode editor
cask "sourcetree"               # Git GUI
cask "p4v"                      # P4Merge tool
cask "firefox"                  # Browser of choice
cask "1password"                # Password manager
cask "zoom"                     # Zoom video conferencing
cask "spotify"                  # Music
cask "twitch"                   # Twitch
cask "obsidian"                 # Note taking
cask "google-drive"             # Google Drive
cask "dropbox"                  # Dropbox sync

tap "homebrew/cask-fonts"
cask "font-jetbrains-mono"      # Coding font
cask "font-inconsolata"         # Monospace font
